app/views/calendars/_form.html.erb

	<tr><th>Picture</th><th>Song</th><th>Movie</th></tr>
<% @calendar.entries.each do |e| %>
---
SELECT `entries`.* FROM `entries` WHERE `entries`.`calendar_id` = 1