app/views/calendars/edit.html.erb

	<tr><th>&nbsp;</th><th>Day</th><th>Picture</th><th>Song</th><th>Movie</th></tr>
<% @calendar.entries.each do |e| %>
---
SELECT `entries`.* FROM `entries` WHERE `entries`.`calendar_id` = 1 ORDER BY day