app/views/calendars/show.html.erb

SELECT `entries`.* FROM `entries` WHERE `entries`.`calendar_id` = 1 ORDER BY day
---
<% @calendar.entries.each do |entry| %>