app/controllers/calendars_controller.rb

  def index
    @calendars = Calendar.all
---
SELECT `calendars`.* FROM `calendars`

  def show
    @calendar = Calendar.find(params[:id])
---
SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`id` = 1 LIMIT 1

  def edit
    @calendar = Calendar.find(params[:id])
---
SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`id` = 1 LIMIT 1

  def create
    @calendar = Calendar.new(params[:calendar])

    respond_to do |format|
      if @calendar.save
---
INSERT INTO `calendars` (`created_at`, `name`, `pub_date`, `updated_at`) VALUES ('2012-11-24 13:50:44', '2012', '2012-01-12', '2012-11-24 13:50:44')

  def update
    @calendar = Calendar.find(params[:id])

    respond_to do |format|
      if @calendar.update_attributes(params[:calendar])
---
SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`id` = 1 LIMIT 1
UPDATE `calendars` SET `background_file_name` = '50\'_s_pic_TV.JPG', `background_content_type` = 'image/jpeg', `background_file_size` = 1037372, `background_updated_at` = '2012-11-25 17:12:11', `updated_at` = '2012-11-25 17:12:11' WHERE `calendars`.`id` = 1

  def radio
    @calendar = Calendar.find(params[:id])
---
SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`id` = 1 LIMIT 1