app/controllers/entries_controller.rb

SELECT `entries`.* FROM `entries` ORDER BY day
---
  def index
    @entries = Entry.all

SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`id` IS NULL LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`day` = 1 AND `entries`.`calendar_id` = 1
---
  def show
    @calendar = Calendar.find_by_id(params[:calendar_id])
    @entry = Entry.where(" day = ? and calendar_id = ?", params[:id], @calendar.id).first

SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`id` IS NULL LIMIT 1
---
  def new
    @entry = Entry.new
    @entry.calendar = Calendar.find_by_id(params[:calendar_id])

SELECT `entries`.* FROM `entries` WHERE `entries`.`id` = 1 LIMIT 1
---
  def form
    @entry = Entry.find(params[:id])

SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`id` IS NULL LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`id` = 1 ORDER BY day LIMIT 1
---
  def edit
    @calendar = Calendar.find_by_id(params[:calendar_id])
    @entry = Entry.find(params[:id])

SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`id` = 1 LIMIT 1
INSERT INTO `entries` (`calendar_id`, `created_at`, `day`, `movie_id`, `picture_id`, `song_id`, `updated_at`, `x`, `y`) VALUES (1, '2012-12-01 01:28:07', 1, NULL, 1, 1, '2012-12-01 01:28:07', NULL, NULL)
---
  def create
    @calendar = Calendar.find_by_id(params[:calendar_id])
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save

SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`id` IS NULL LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`id` = 1 LIMIT 1
UPDATE `entries` SET `song_id` = 1, `picture_id` = 1, `updated_at` = '2012-12-02 14:34:55' WHERE `entries`.`id` = 1
---
  def update
    @calendar = Calendar.find_by_id(params[:calendar_id])
    @entry = Entry.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])

SELECT `entries`.* FROM `entries` WHERE `entries`.`id` = 5 LIMIT 1
DELETE FROM `entries` WHERE `entries`.`id` = 5
---
  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy